; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.9.0
; Author:	ZityiSoft <zityisoft@gmail.com>
; Homepage:	http://szoftverforditasok.hu
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=Fájl
2=Opciók
3=Súgó
4=Ellenőrzés először SF&X archívumként
; ------------------------------------
5=Fájl kiválasztása
6=Kicsomagolandó &archívum/telepítő:
7=Mappa kiválasztása
8=Ki&csomagolási mappa:
9=Húzza a kicsomagolandó fájlt erre az ablakra
; ------------------------------------
10=%s opciók
11=A&rchiválási előzmények megőrzése
12=Kon&zolablak elrejtése
13=Frissítési &emlékeztető :
14=&Nyelv :
15=&Jegyezze meg és zárolja az ablak méretét
16=Ne zárja be az ablakot kicsomagolás &után
; ------------------------------------
17=Formátum-specifikus opciók
18=Figyelmeztetés a fájlok végrehajtása el&őtt
19=&Ismétlődő fájlok eltávolítása
20=Ideiglenes fájlok el&távolítása
21=&Hiányzó fájl kiterjesztések hozzáfűzése
22=Fájl törlése a &sikeres kicsomagolás után
; ------------------------------------
23=Névjegy
; ------------------------------------
24=%s weboldal
25=Hivatalos változat weboldala
26=Módosított változat fóruma
; ------------------------------------
27=Frissítés
28=Az utolsó ellenőrzés több mint %s napja volt!
29=Ellenőrzi a frissítéseket?
30=Inte&grálás a helyi menübe
; ------------------------------------
31=&Kicsomagolás
32=&Mentés
33=&Frissítés
34=M&égse
35=Beállítások
; ------------------------------------
36=A(z) %s kicsomagolása
37=Az %s a következő %s kicsomagolási módszereket támogatja.%nSajnos, a jelenlegi módszerek egyike sem teljesen megbízható.%nHa a kiválasztott módszer nem működik, kérjük, futtassa újra az %s programot, és válasszon ki egy másik módszert.
; ------------------------------------
38=Kicsomagolási mód
39=%s adminisztratív telepítő
40=%s kicsomagolás
41=%s kapcsoló
42=%s kicsomagoló
43=Nem InstallShield telepítő
44=Összef&oglaló megjelenítése kicsomagolás után
; ------------------------------------
; GUI control functions
45=Hangok &letiltása a programban
46=7-Zip verziók
47=A fájl nem létezik:%n%s%nKérjük, válasszon ki egy létező fájlt.
48=Fájl megnyitása
49=Írás
50=Összes
; Common terms
51=archívum
52=tömörített fájl
53=Idő: %s
54=ebook
55=ecard
56=kódolt fájl
57=ismeretlen végrehajtható fájl
58=Az előkészítés sikertelen volt
59=súgó fájl
60=gyorsjavítás
61=kép
62=telepítő
63=egyesítési modul
64=csomag
65=javítás
66=Önkicsomagoló
67=szakasz
68=Az előkészítés sikeres volt
69=Tesztelés
70=Kicsomagolás:
71=Archívum mérete
72=frissítés
73=Archívum neve
74=Hetente|Kéthetente|Havonta|Soha
; Status messages
75=Fájl vizsgálata a fájltípus meghatározásához
76=Fájl elemzése %s vizsgálat végrehajtásával
77=Fájlok kicsomagolása a következőből:
78=Várakozás a telepítő előkészítésére.%nKis türelmet
79=A kicsomagolás megszakításához, nyomja meg az ESC gombot%nAz ablak minimalizálása/visszaállítása az F11 billentyűvel lehetséges
; Custom prompts
80=A(z) %s CD-ROM képfájlok közvetlen kicsomagolására nincs lehetőség.%nEhelyett, az állomány ISO CD-ROM képfájlba lesz konvertálva,%namely azt követően már kicsomagolható.%n%nSzeretné folytatni?%nMegjegyzés: Ez a folyamat akár több percig is eltarthat!
81=Hiba: A CD-ROM képfájl nem alakítható át.
82=Hiba: Egy ISO képfájl lett létrehozva a(z) %s képállományból, de annak kicsomagolása sikertelen volt.%nTovábbi elemzésre megtartja az ISO képfájlt?
83=Hiba: Ez érvénytelen MHT fájlnak tűnik.%nA határolópontok észlelése sikertelen volt.
84=%s. Kérjük, lépjen ki a telepítőből, majd kattintson az OK gombra a folytatáshoz.
85=Megjegyzés: Ez a módszer csak bizonyos Wise for Windows telepítőcsomagoknál működik.%nHa a Wise telepítés varázsló elindul és a beviteli módra vár, ez a fájl nem támogatott.%nKérjük, lépjen ki a telepítőből, és az %s meg fogja szakítani a kicsomagolást.%n%nTovábbra is folytatni szeretné a kicsomagolást?
86=Ez a fájl %s tömörítést használ. Folytathatja a kibontást a(z) %s kicsomagolása nélkül vagy elvégezheti csak a(z) %s kicsomagolását.%n%nKattintson az "Igen" gombra a kibontáshoz a(z) %s kicsomagolása nélkül.%n%nKattintson a "Nem" gombra csak a(z) %s kicsomagolásának futtatásához.%n%nEz utóbbi esetben a kibontott fájl neve a következő lesz:%n%s
87=Hiba: %s%nnem csomagolható ki.
88=Figyelem: Az ilyen típusú fájlok kibontásához, a fájl közvetlen futtatására van szükség.%nHa folytatja, a következő parancsot kell futtatni:%n%n%s%n%nHa úgy véli, hogy a fájl esetleg rosszindulatú lehet, azt ajánljuk ne folytassa.%nSzeretné folytatni a kicsomagolást?
89=Figyelem: A(z) %s célmappa már létezik!%nA fájlokat tartalmazó mappába végzett kibontás akár kicsomagolási hibákhoz is vezethet.%n%nTörli a mappa tartalmát kicsomagolás előtt?
90=Jelszó szükséges a kicsomagoláshoz!%n%nInaktiválja ezt: '%s'%na jelszó bevitel engedélyezéséhez.
91=A jelenlegi archívum kibontásához, kiegészítő %s %nkicsomagolóra van szükség
; Help text
92=Fájlok kicsomagolása bármilyen archívum típusból vagy telepítőcsomagból.%nHasználat:%n%s%n%nTámogatott paraméterek:%n%s%t%tA jelenlegi súgó információk megjelenítése%n%s%t%tLap megnyitása %s%n%s%tA kicsomagolandó fájl neve%n%s%tKönytár a kicsomagoláshoz%n%nA(z) %s célkönyvtár nevének elfogadása helyett az archívummal%n%s megegyező nevű alkönyvtárba hajtja végre a kicsomagolást.%n%nPélda:%s%n%nA(z) %s futtatása argumentum nélkül jeleníti meg a fő ablakot, ahol a felhasználó megadhatja a fájl nevét és a cél könyvtárat.
93=Kicsomagolás az %s programmal
; Error messages
94=A(z) %s kicsomagolása nem naplózható.
95=7-zip archiváló
96=A(z) %s nem csomagolható ki.%nVisszaküldött fájltípus: %s%n%nKattintson az 'OK' gombra, ha egyénileg szeretné elemezni a fájlt, vagy válassza a 'Mégse' gombot a kilépéshez.
97=%s%nismeretlen kiterjesztéssel rendelkezik és nem csomagolható ki.
98=Nem sikerült létrehozni a mappát:%n%s%nKérjük, válasszon ki egy érvényes célmappát.
99=A(z) %s nem csomagolható ki.%nÚgy tűnik, hogy a(z) %s támogatott, viszont a kicsomagolás sikertelen volt.%nTovábbi információkért, kérjük tekintse meg a(z) %s naplófájlt.%n%nKattintson az "OK" gombra a naplófájl azonnali megtekintéséhez, vagy válassza a 'Mégse' gombot a kilépéshez.
100=%t–= %s elemzése =–
; Update messages
101=A frissítés befejeződött
102=Frissítések ellenőrzése, kis türelmet...
103=Fájlok letöltése
104=A letöltés befejeződött!
105=Frissítve a(z) %s verzióra
106=%n%s újraindítása!
107=Jelenlegi verzió: %s%nNincs szükség frissítésre!
; ------------------------------------
108=A letöltés sikertelen
109=Nem sikerült letölteni fájlok listáját a kiszolgálóról.%nA hálózati kapcsolat megszakadt%nvagy a frissítési szerver nem érhető el.
110=Nem sikerült letölteni a fájlt
111=Fájl kicsomagolási hiba
112=Hiba történt a(z) %s%nverzióra frissítésnél. Próbálja újra!!!
113=Befejezve: %s - %s
114=Információk
115=Kicsomagoló modulok változatai
116=Megnyitja a kicsomagolási mappát?
117=Sor a táblázatban
118=Elválasztó
119=Csak az archí&vum felső szintjének megnyitása
120=PE-fájl elemzés
121=Nem sikerült feldolgozni az MSI-fájlt
122=Az MSI-csomag 'mély' elhelyezkedésének köszönhetően nem sikerült beolvasni a(z) %s fájlt.%nTovábbi részletek: %s.%n%nHelyezze az MSI-csomagot a meghajtó gyökerébe, és ismételje meg a kicsomagolást.%n%nKattintson az 'OK' gombra a naplófájl megtekintéséhez, vagy a 'Mégse' gombra a kilépéshez.
123=szignaturák -
124=Kiválasztja manuálisan az archívum típusát (a listából) ?
125=Válassza ki az állítólagos archívum típus aláírását
126=Megpróbálja kicsomagolni a 'TotalObserver'-rel ?